import 'package:flutter/material.dart';

class Dummy extends ChangeNotifier {
  List<Map<String, dynamic>> category = [
    {
      'category': 'กำลังฮิต',
      'item': [
        {
          'name': 'กำลังฮิต1 กำลังฮิต1 กำลังฮิต1',
          'description': 'ลองอ่าน รับ 200 แคช',
          'event': ['top1', 'ตั๋วฟรี', 'ใหม่', 'กิจกรรม', 'เรื่องใหม่'],
        },
        {
          'name': 'กำลังฮิต2',
          'description': 'ลองอ่าน รับ 200 แคช',
          'event': ['ตั๋วฟรี', 'ใหม่'],
        },
        {
          'name': 'กำลังฮิต3',
          'description': 'ลองอ่าน รับ 200 แคช',
          'event': ['ตั๋วฟรี', 'ใหม่'],
        },
        {
          'name': 'กำลังฮิต4',
          'description': 'ลองอ่าน รับ 200 แคช',
          'event': ['ตั๋วฟรี', 'ใหม่'],
        },
        {
          'name': 'กำลังฮิต5',
          'description': 'ลองอ่าน รับ 200 แคช',
          'event': ['ตั๋วฟรี', 'ใหม่'],
        },
        {
          'name': 'กำลังฮิต6',
          'description': 'ลองอ่าน รับ 200 แคช',
          'event': ['ตั๋วฟรี', 'ใหม่'],
        },
        {
          'name': 'กำลังฮิต7',
          'description': 'ลองอ่าน รับ 200 แคช',
          'event': ['ตั๋วฟรี', 'ใหม่'],
        },
      ],
    },
    {
      'category': 'โรแมนซ์แฟนตาซี',
      'item': [
        {
          'name': 'โรแมนซ์แฟนตาซี1 โรแมนซ์แฟนตาซี1 โรแมนซ์แฟนตาซี1',
          'description': 'ลองอ่าน รับ 200 แคช',
          'event': ['ตั๋วฟรี', 'ใหม่', 'กิจกรรม', 'เรื่องใหม่'],
        },
        {
          'name': 'โรแมนซ์แฟนตาซี2',
          'description': 'ลองอ่าน รับ 200 แคช',
          'event': ['กิจกรรม', 'เรื่องใหม่'],
        },
        {
          'name': 'โรแมนซ์แฟนตาซี3',
          'description': 'ลองอ่าน รับ 200 แคช',
          'event': ['กิจกรรม', 'เรื่องใหม่'],
        },
        {
          'name': 'โรแมนซ์แฟนตาซี4',
          'description': 'ลองอ่าน รับ 200 แคช',
          'event': ['กิจกรรม', 'เรื่องใหม่'],
        },
        {
          'name': 'โรแมนซ์แฟนตาซี5',
          'description': 'ลองอ่าน รับ 200 แคช',
          'event': ['กิจกรรม', 'เรื่องใหม่'],
        },
        {
          'name': 'โรแมนซ์แฟนตาซี6',
          'description': 'ลองอ่าน รับ 200 แคช',
          'event': ['กิจกรรม', 'เรื่องใหม่'],
        },
        {
          'name': 'โรแมนซ์แฟนตาซี7',
          'description': 'ลองอ่าน รับ 200 แคช',
          'event': ['กิจกรรม', 'เรื่องใหม่'],
        },
      ],
    },
    {
      'category': 'โรแมนซ์',
      'item': [
        {'name': 'โรแมนซ์1'},
        {'name': 'โรแมนซ์2'},
        {'name': 'โรแมนซ์3'},
        {'name': 'โรแมนซ์4'},
      ],
    },
    {
      'category': 'ดราม่า',
      'item': [
        {'name': 'ดราม่า1'},
        {'name': 'ดราม่า2'},
        {'name': 'ดราม่า3'},
        {'name': 'ดราม่า4'},
      ],
    },
    {
      'category': 'สยองขวัญ',
      'item': [
        {'name': 'สยองขวัญ1'},
        {'name': 'สยองขวัญ2'},
        {'name': 'สยองขวัญ3'},
        {'name': 'สยองขวัญ4'},
      ],
    },
    {
      'category': 'วาย',
      'item': [
        {'name': 'วาย1'},
        {'name': 'วาย2'},
        {'name': 'วาย3'},
        {'name': 'วาย4'},
      ],
    },
    {
      'category': 'แอ็กชัน',
      'item': [
        {'name': 'แอ็กชัน1'},
        {'name': 'แอ็กชัน2'},
        {'name': 'แอ็กชัน3'},
        {'name': 'แอ็กชัน4'},
      ],
    },
    {
      'category': 'เรียลไทม์',
      'item': [
        {'name': 'เรียลไทม์1'},
        {'name': 'เรียลไทม์2'},
        {'name': 'เรียลไทม์3'},
        {'name': 'เรียลไทม์4'},
      ],
    },
  ];
}
